dot-emacs-dot-d/config.org
#+AUTHOR: Akash Agrawal
#+EMAIL: akagr@outlook.com
#+PROPERTY: header-args :results silent :tangle "./init.el"
#+STARTUP: content
#+babel: :cache yes

This is my [[https://www.gnu.org/software/emacs/][Emacs]] config, written using [[https://orgmode.org][Org]] in literate environment. I use this primarily on macOS and haven't tested it on other platforms, but I imagine most of the code works with minor to no changes on Linux and possibly Windows too.

* Early Init
:properties:
:header-args+: :tangle "./early-init.el"
:end:

** Check for minimum version
#+BEGIN_SRC emacs-lisp
  (let ((min-version "29"))
    (if (version< emacs-version min-version)
        (error "Emacs version is %s. Minimum required version is %s."
               emacs-version
               min-version)))
#+END_SRC
** Make emacs occupy full screen
#+BEGIN_SRC emacs-lisp
  (setq frame-resize-pixelwise t)
#+END_SRC
** Defer Compilation
#+BEGIN_SRC emacs-lisp
  (defvar comp-deferred-compilation)
  (setq comp-deferred-compilation t)
#+END_SRC

** Speed Boost
#+BEGIN_SRC emacs-lisp
  (setq package-enable-at-startup nil
        frame-inhibit-implied-resize t)
#+END_SRC

** Reduce GC
Following [[https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org#how-does-doom-start-up-so-quickly][Doom-Emacs FAQ]], we max the garbage collection threshold on startup, and reset it to the original value after.
#+BEGIN_SRC emacs-lisp
  ;; max memory available for gc on startup
  (defvar aa/gc-cons-threshold 16777216)
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6)
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold aa/gc-cons-threshold
                    gc-cons-percentage 0.1)))

  ;; max memory available for gc when opening minibuffer
  (defun aa/defer-garbage-collection-h ()
    (setq gc-cons-threshold most-positive-fixnum))

  (defun aa/restore-garbage-collection-h ()
    ;; Defer it so that commands launched immediately after will enjoy the
    ;; benefits.
    (run-at-time
     1 nil (lambda () (setq gc-cons-threshold aa/gc-cons-threshold))))

  (add-hook 'minibuffer-setup-hook #'aa/defer-garbage-collection-h)
  (add-hook 'minibuffer-exit-hook #'aa/restore-garbage-collection-h)
  (setq garbage-collection-messages nil)
#+END_SRC

Temporarily avoid special handling of files
#+BEGIN_SRC emacs-lisp
  (defvar aa/-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq file-name-handler-alist aa/-file-name-handler-alist)))
#+END_SRC

** Disable Site Run
#+BEGIN_SRC emacs-lisp
  (setq site-run-file nil)
#+END_SRC

** Don't compact font caches
#+BEGIN_SRC emacs-lisp
  (setq inhibit-compacting-font-caches t)
#+END_SRC

** Improve I/O
Optimizations for improving I/O performance. Increase max bytes read from a sub-process in a single op (Emacs 27+)
#+BEGIN_SRC emacs-lisp
  (when (boundp 'read-process-output-max)
    ;; 1MB in bytes, default 4096 bytes
    (setq read-process-output-max 1048576))
#+END_SRC

** Straight.el
[[https://github.com/raxod502/straight.el][straight.el]] is used to download packages for us from all over the web. It stores them all in their respective git folders in =.emacs.d/straight=, which makes debugging, and contributing fixes back upstream as easy as possible.

Updating some settings so straight.el can play nicely with use-package.
#+BEGIN_SRC emacs-lisp
  (setq straight-use-package-by-default t
        straight-cache-autoloads t
        straight-check-for-modifications '(check-on-save)
        straight-vc-git-default-clone-depth 1
        vc-follow-symlinks t)
#+END_SRC

Fetching =straight.el=.
#+BEGIN_SRC emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
  (setq vc-follow-symlinks 'ask) ; restore default
#+END_SRC

Loading an optional package which gives us some convenience functions, like ~straight-x-clean-unused-repo~ to remove any packages we don't have configured anymore.
#+begin_src emacs-lisp
  (require 'straight-x)
#+end_src

Installing =use-package= now.
#+BEGIN_SRC emacs-lisp
  (straight-use-package 'use-package)
#+END_SRC

** Use the garbage collector magic hack
#+begin_src emacs-lisp
  (use-package gcmh
    :demand t
    :config (gcmh-mode 1))
  #+end_src
** Set custom file
#+BEGIN_SRC emacs-lisp
  (setq custom-file (expand-file-name "emacs-custom.el" user-emacs-directory))
  (load custom-file t)
#+END_SRC
** End early init
#+BEGIN_SRC emacs-lisp
  (provide 'early-init)
#+END_SRC

* External Dependencies

- Download ~elixir-ls~ from https://github.com/JakeBecker/elixir-ls and adjust the path of language server in eglot config.

* Bootstrapping and Default

** Setup load path
#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
#+END_SRC

** Update defaults
Turn off auto backup files, startup message and other more sensible defaults.
#+BEGIN_SRC emacs-lisp
  (setq auto-save-default nil
        create-lockfiles nil
        make-backup-files nil
        inhibit-startup-message t
        load-prefer-newer t
        ring-bell-function 'ignore
        sentence-end-double-space nil
        confirm-kill-processes nil)
#+END_SRC

Don't use tabs for indentation. Also truncate lines instead of wrapping them.
#+BEGIN_SRC emacs-lisp
  (setq-default indent-tabs-mode nil
                truncate-lines t)
#+END_SRC

Use y or n instead of yes or no. Additionally, use ibuffers to be consistent with buffer management and not having to worry about wrong key chords.
#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
  (defalias 'list-buffers 'ibuffer)
#+END_SRC

Turn off all the chrome that emacs puts by default.
#+BEGIN_SRC emacs-lisp
  (progn
    (scroll-bar-mode -1)
    (tool-bar-mode -1)
    (menu-bar-mode -1)
    (tooltip-mode -1))
#+END_SRC

A few modes are turned on by default
#+BEGIN_SRC emacs-lisp
  (global-so-long-mode) ;; handles really long lines well
  (column-number-mode) ;; show column number in mode line
  (global-auto-revert-mode) ;; reflect changes on disk to file automatically
  (show-paren-mode) ;; show matching delimiters
  (global-display-line-numbers-mode) ;; show line numbers in all buffers
#+END_SRC

Make the command key behave as 'meta' on macOS.
#+BEGIN_SRC emacs-lisp
  (when (eq system-type 'darwin)
    (setq mac-option-key-is-meta nil
          mac-command-key-is-meta t
          mac-command-modifier 'meta
          mac-option-modifier 'super))
#+END_SRC

Delete whitespace on save
#+BEGIN_SRC emacs-lisp
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (add-hook 'after-change-major-mode-hook
            (lambda ()
              (modify-syntax-entry ?_ "w")))
#+END_SRC

* Custom Functions

** Copy current file path relative to project root.
#+BEGIN_SRC emacs-lisp
  (defun aa/copy-file-path ()
    "Copy file path of current buffer relative to project root."
    (interactive)
    (kill-new (file-relative-name buffer-file-name (projectile-project-root))))

  (defalias 'copy-file-path 'aa/copy-file-path)
#+END_SRC

** Kill this buffer and window, as long as it's not the only window open.
#+begin_src emacs-lisp
  (defun aa/close-and-kill-this-pane ()
    "If there are multiple windows, then close this one and kill its buffer"
    (interactive)
    (kill-this-buffer)
    (if (not (one-window-p))
        (delete-window)))
#+end_src

** Add custom methods to correctly locate elixir and rails projects inside a multi-project monorepo.
#+BEGIN_SRC emacs-lisp
  (defun aa/find-mix-project (dir)
    "Try to locate a Elixir project root by 'mix.exs' above DIR."
    (let ((mix_root (locate-dominating-file dir "mix.exs")))
      (message "Found Elixir project root in '%s' starting from '%s'" mix_root dir)
      (if (stringp mix_root) `(transient . ,mix_root) nil)))

  (defun aa/find-rails-project (dir)
    "Try to locate a Rails project root by 'Gemfile' above DIR."
    (let ((rails_root (locate-dominating-file dir "Gemfile")))
      (message "Found Rails project root in '%s' starting from '%s'" rails_root dir)
      (if (stringp rails_root) `(transient . ,rails_root) nil)))
#+END_SRC

** Print emacs startup time
#+BEGIN_SRC emacs-lisp
  (defun aa/print-startup-time ()
    "Log emacs startup time"
    (interactive)
    (message "Emacs started in %s with %d garbage collections."
             (format
              "%.2f seconds"
              (float-time
               (time-subtract after-init-time before-init-time)))
             gcs-done))
#+END_SRC

** Convert strings to dash case
#+BEGIN_SRC emacs-lisp
  (defun aa/dashcase (str)
    "Converts a string to dash case.

     Example:
     (aa/dashcase \"Hello World\")
     => \"hello-world\" "
    (let ((down (downcase str)))
      (replace-regexp-in-string "\\([^A-Za-z]\\)" "-" down)))
#+END_SRC
* Support Packages

Loading emacs from finder or spotlight causes it to not load many environment variables. This package fixes it.
#+BEGIN_SRC emacs-lisp
  (cl-loop for file in '("/opt/homebrew/bin/fish"
                         "/usr/local/bin/fish"
                         "/bin/fish"
                         "/opt/homebrew/bin/zsh"
                         "/usr/local/bin/zsh"
                         "/bin/zsh"
                         "/opt/homebrew/bin/bash"
                         "/usr/local/bin/bash"
                         "/bin/bash")
           when (file-exists-p file)
           do (progn
                (setq shell-file-name file)
                (cl-return)))
  (setenv "SHELL" shell-file-name)

  (use-package exec-path-from-shell
    :config
    (exec-path-from-shell-initialize))
#+END_SRC

Various packages that are used by numerous other packages.
+ `which-key` allows using keybindings interactively. For example, if `<leader>gs` is mapped to `magit-status`, and I press only `<leader>g`, it'll show all the keys and commands that are valid follows.
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :config
    (which-key-mode)
    (which-key-setup-side-window-bottom)
    :custom (which-key-idle-delay 0.3))
#+END_SRC

Simplify leader bindings with general.el.
#+begin_src emacs-lisp
  (use-package general
    :config
    (general-evil-setup t)

    (general-create-definer aa/leader-key-def
      :keymaps '(normal insert visual emacs)
      :prefix ","
      :global-prefix "C-,"))
#+end_src
* Common Keybindings

#+BEGIN_SRC emacs-lisp
  (aa/leader-key-def
    "e"  '(:ignore t :which-key "emacs")
    "ee" '((lambda () (interactive) (find-file (expand-file-name "config.org" user-emacs-directory))) :which-key "open config")
    "er" '((lambda () (interactive) (load-file user-init-file)) :which-key "reload config")
    "ek" '(kill-emacs :which-key "kill emacs")

    "f"  '(:ignore t :which-key "file")
    "ff" '(find-file :which-key "find")

    "t"  '(:ignore t :which-key "toggle")
    "tt" '(load-theme :which-key "theme")
    "tw" '(toggle-truncate-lines :which-key "wrap lines")

    "c"  '(:ignore t :which-key "code")
    "ca" '(align-regexp :which-key "align regex")
    "cc" '(xref-find-definitions :which-key "find definitions")
    "ce" '(eval-last-sexp :which-key "eval last sexp")
    "cr" '(xref-find-references :which-key "find references"))
#+END_SRC
* Helpful Instrospection

[[https://github.com/Wilfred/helpful][Helpful]] allows much better help (introspection) pages. For example, when showing help for functions, it shows references, source code etc. all on single page. This reduces jumping to different locations frequently.
#+BEGIN_SRC emacs-lisp
  (use-package helpful
    :commands (helpful-callable
               helpful-variable
               helpful-key
               helpful-at-point
               helpful-command
               helpful-macro
               helpful-function))
  (aa/leader-key-def
    "h"  '(help-command :which-key "help")
    "hf" '(helpful-callable :which-key "functions")
    "hg" '(google :which-key "google")
    "hk" '(helpful-key :which-key "key-bindings")
    "hm" '(consult-minor-mode-menu :which-key "consult-minor-mode-menu")
    "hv" '(helpful-variable :which-key "variables"))
#+END_SRC
* Evil Mode

Add undo package to allow branching undos.
#+begin_src emacs-lisp
  (use-package undo-fu)
#+end_src

Being a long time (neo)vim user, I use evil mode exclusively for editing. When they say it's impossible to get out of vim, it has a deeper meaning.
I use different colored cursors to depict what mode I'm in. Way easier to work with than looking at minibuffer.
#+BEGIN_SRC emacs-lisp
  (use-package evil
    :init
    (setq evil-respect-visual-line-mode t
          evil-undo-system 'undo-fu
          evil-want-integration t
          evil-want-keybinding nil)
    :config
    (evil-mode)
    (setq evil-emacs-state-modes (delq 'ibuffer-mode evil-emacs-state-modes)
          evil-emacs-state-cursor '("indian red" box)
          evil-normal-state-cursor '("indian red" box)
          evil-visual-state-cursor '("royal blue" box)
          evil-insert-state-cursor '("yellow green" box)
          evil-replace-state-cursor '("red" box)
          evil-operator-state-cursor '("red" hollow)))
#+END_SRC

Commentary package allows me to retain my muscle memory of (un)commenting code.
#+BEGIN_SRC emacs-lisp
  (use-package evil-commentary
    :after evil
    :config
    (evil-commentary-mode))
#+END_SRC

Evil surround for adding quotes, parenthesis etc. Another takeaway from vim.
#+begin_src emacs-lisp

  (use-package evil-surround
    :after evil
    :config
    (global-evil-surround-mode 1))
#+end_src

[[https://github.com/gabesoft/evil-mc][evil-mc]] adds an awesome multiple cursor mode.
#+BEGIN_SRC emacs-lisp
  (use-package evil-mc
    :config
    (global-evil-mc-mode 1))
#+END_SRC

~evil-collection~ adds evil bindings for packages and modes not covered by ~evil~.
#+BEGIN_SRC emacs-lisp
  (use-package evil-collection
    :init
    (evil-collection-init
     '(dired
       dired-sidebar
       ediff
       embark
       grep
       helpful
       ibuffer
       magit
       man
       occur
       process-menu
       rg
       sly
       smerge
       vterm
       wgrep
       xref
       ztree)))
#+END_SRC

* Org Mode
:properties:
:header-args+: :tangle "./lisp/init-org.el"
:end:

** Load relevant config when org is loaded
This gets placed in ~init.el~ and requires all the code following it related to org mode.
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
  (add-hook 'org-mode-hook
            (lambda ()
              (require 'init-org)))

  (with-eval-after-load 'org
    (setq org-startup-indented t
          org-hide-emphasis-markers t
          org-fontify-done-headline t
          org-hide-leading-stars t
          org-pretty-entities t
          org-src-fontify-natively t
          org-src-tab-acts-natively t
          truncate-lines nil))
#+END_SRC

** Align tags on save
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
  (add-hook 'org-mode-hook
            (lambda ()
              (add-hook 'before-save-hook
                        (lambda ()
                          (org-align-tags t))
                        nil t)))
#+END_SRC

