dot-emacs-dot-d/config.org
** Set up org default files and directories:

#+begin_src emacs-lisp
  (setq org-directory "~/Dropbox/org"
        org-default-notes-file (concat org-directory "/notes.org")
        org-agenda-files '("~/Dropbox/org/")
        org-archive-location (concat org-directory "/archive/%s::"))
#+end_src

** Show hidden elements under point
#+BEGIN_SRC emacs-lisp
  (use-package org-appear
    :custom
    (org-appear-autolinks t)
    (org-appear-submarkers t)
    (org-appear-delay 0.5)
    :hook (org-mode . org-appear-mode))

  ;; Start once on initial org load.
  ;; The hook above takes care of starting it on subsequent loads.
  (org-appear-mode)
#+END_SRC
** Keybindings for org mode.

#+begin_src emacs-lisp
  (aa/leader-key-def
    "r"  '(:ignore t :which-key "org mode")
    "ra" '(org-agenda :which-key "agenda")
    "rc" '(org-capture :which-key "capture")
    "re" '(org-export-dispatch :which-key "export")
    "ri" '((lambda () (interactive) (org-indent-block)) :which-key "indent block")
    "rl" '(org-store-link :which-key "store Link")
    "ro" '((lambda () (interactive) (find-file org-default-notes-file)) :which-key "open notes")
    "rp" '(org-present :which-key "present")
    "rt" '(org-babel-tangle :which-key "tangle"))
#+end_src

** Enable helpful org-specific minor modes

#+BEGIN_SRC emacs-lisp
  ;; Turn on visual line mode to wrap lines.
  (visual-line-mode)
  (add-hook 'org-mode-hook #'visual-line-mode)

  ;; Turn on variable pitch mode to use different scale for headings
  (variable-pitch-mode)
  (add-hook 'org-mode-hook #'variable-pitch-mode)

  ;; If the source block contains code that outputs images,
  ;; show them inline in results area.
  (add-hook 'org-babel-after-execute-hook #'org-redisplay-inline-images)
#+END_SRC

** Org bullets

=org-bullets= package prettifies the headline markers.

#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :custom
    (org-bullets-bullet-list '("☯" "✸" "✿" "✜" "◆" "◉" "▶" "○"))
    :hook (org-mode . org-bullets-mode))

  ;; Start once on initial org load.
  ;; The hook above takes care of starting it on subsequent loads.
  (org-bullets-mode)
#+END_SRC

** Evil org mode

Helps with evil keybindings in =org-mode=.

#+BEGIN_SRC emacs-lisp
  (use-package evil-org
    :hook (org-mode . evil-org-mode)
    :init
    (add-hook 'evil-org-mode-hook
              (lambda ()
                (evil-org-set-key-theme)))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))

  ;; Start once on initial org load.
  ;; The hook above takes care of starting it on subsequent loads.
  (evil-org-mode)
#+END_SRC

** Font and text customisation

Replace default block delimiters with ligatures
#+BEGIN_SRC emacs-lisp
  (setq-default prettify-symbols-alist '(("#+BEGIN_SRC" . "λ")
                                         ("#+END_SRC" . "λ")
                                         ("#+begin_src" . "λ")
                                         ("#+end_src" . "λ")))
  (setq prettify-symbols-unprettify-at-point t)

  (prettify-symbols-mode)
  (add-hook 'org-mode-hook 'prettify-symbols-mode)
#+END_SRC

Replace list bullets with prettier dots.
#+BEGIN_SRC emacs-lisp
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([+]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "◦"))))))
#+END_SRC

** Presentations with Org

Add ability to present org files.
#+BEGIN_SRC emacs-lisp
  (use-package org-present
    :commands (org-present)
    :config
    (add-hook 'org-present-mode-hook
                 (lambda ()
                   (display-line-numbers-mode -1)
                   (org-display-inline-images)
                   (org-present-hide-cursor)
                   (org-present-read-only)))
       (add-hook 'org-present-mode-quit-hook
                 (lambda ()
                   (display-line-numbers-mode +1)
                   (org-remove-inline-images)
                   (org-present-show-cursor)
                   (org-present-read-write))))
#+END_SRC
** Org drill
Allows preparing flashcard like interface for spaced repetition and revision. Check out the [[https://gitlab.com/phillord/org-drill/][repo]] for more info.
#+BEGIN_SRC emacs-lisp
  (use-package org-drill
    :commands (org-drill))
#+END_SRC
** Auto tangle this file after save
#+BEGIN_SRC emacs-lisp
  (use-package async
    :demand t)

  (defvar *config-file* (expand-file-name "config.org" user-emacs-directory)
    "The configuration file.")

  (defvar *show-async-tangle-results* nil
    "Keeps *emacs* async buffers around for later inspection.")

  (defun aa/async-babel-tangle (org-file)
    "Tangles the org file asynchronously."
    (let ((init-tangle-start-time (current-time))
          (file (buffer-file-name))
          (async-quiet-switch "-q"))
      (async-start
       `(lambda ()
          (require 'ob-tangle)
          (org-babel-tangle-file ,org-file))
       (unless *show-async-tangle-results*
         `(lambda (result)
            (if result
                (message "SUCCESS: %s successfully tangled (%.2fs)."
                         ,org-file
                         (float-time
                          (time-subtract (current-time)
                                         ',init-tangle-start-time)))
              (message "ERROR: %s as tangle failed." ,org-file)))))))

  (defun aa/config-tangle ()
    "Tangles the org file asynchronously."
    (aa/async-babel-tangle *config-file*))

  (add-hook 'org-mode-hook
            (lambda ()
              (when (and buffer-file-truename
                         (equal (file-name-nondirectory buffer-file-truename)
                                "config.org"))
                (add-hook 'after-save-hook
                          'aa/config-tangle
                          nil 'make-it-local))))
#+END_SRC

** Provide org package

Provide org package for ~require~.
#+BEGIN_SRC emacs-lisp
  (provide 'init-org)
#+END_SRC
* Code folding
#+BEGIN_SRC emacs-lisp
  (add-hook 'prog-mode-hook #'hs-minor-mode)

  ;; Evil bindings to work with folds
  ;; za - toggle fold
  ;; zc - close fold
  ;; zo - open fold
  ;; zm - close all folds
  ;; zr - open all folds
#+END_SRC
* Better UX for Completions

Add =vertico= to handle all the menu presentation.
#+BEGIN_SRC emacs-lisp
  (use-package vertico
    :init
    (vertico-mode)
    :custom
    (vertico-cycle t))
#+END_SRC

Save history of selections across emacs sessions.
#+BEGIN_SRC emacs-lisp
  (use-package savehist
    :init
    (savehist-mode))
#+END_SRC

Add =marginalia= for richer annotations in menus.
#+BEGIN_SRC emacs-lisp
  (use-package marginalia
    :after vertico
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :init
    (marginalia-mode))
#+END_SRC

Add =orderless= for saner ordering and filtering of completion candidates.
#+BEGIN_SRC emacs-lisp
  (use-package orderless
    :custom
    (completion-styles '(orderless))
    (completion-category-defaults nil)
    (completion-category-overrides '(file (styles partial-completion))))
#+END_SRC


Add extra completion commands ala =consult=.
#+BEGIN_SRC emacs-lisp
  (use-package consult
    :init
    (advice-add #'completing-read-multiple :override #'consult-completing-read-multiple)
    (setq xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)
    :config
    (setq consult-project-root-function #'projectile-project-root))
#+END_SRC

=embark= allows 'right-click' behaviour. i.e. it allows adding contextual actions to things.
#+BEGIN_SRC emacs-lisp
  (use-package embark
    :bind
    (("C-." . embark-act)         ;; pick some comfortable binding
     ("C-;" . embark-dwim)        ;; good alternative: M-.
     ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

    :custom
    ;; This effectively disables the comfirmation for anything not
    ;; listed.
    (embark-allow-edit-commands
     '(shell-command async-shell-command pp-eval-expression))

    :init
    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command
          embark-quit-after-action '((kill-buffer . nil)
                                     (t . nil)))

    :config
    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none))))

    (define-key embark-file-map     (kbd "o") #'find-file-other-window)
    (define-key embark-buffer-map   (kbd "o") #'switch-to-buffer-other-window))

  ;; Consult users will also want the embark-consult package.
  (use-package embark-consult
    :after (embark consult)
    :demand t ;; only necessary if you have the hook below
    ;; if you want to have consult previews as you move around an
    ;; auto-updating embark collect buffer
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))
#+END_SRC

Add common keybindings for buffer.
#+BEGIN_SRC emacs-lisp
  (general-define-key
   :states 'normal
   "C-s" 'consult-line
   "C-h m" 'consult-minor-mode-menu)
#+END_SRC

* VCS

The primary git interface I use, and also one of the main reasons I use emacs.
#+BEGIN_SRC emacs-lisp
  (use-package magit
    :commands (magit magit-status magit-blame))

  (aa/leader-key-def
    "g" '(:ignore t :which-key "git")
    "gb" '(magit-blame :which-key "blame")
    "gc" '(magit-clone :which-key "clone")
    "gf" '(magit-log-buffer-file :which-key "file history")
    "gs" '(magit-status :which-key "status"))
#+END_SRC

Set ediff to use the current frame instead of creating a new one.
#+BEGIN_SRC emacs-lisp
  (setq ediff-window-setup-function 'ediff-setup-windows-plain)
#+END_SRC

When we use ~emacsclient~, we need to export ~$EDITOR~ environment variable to correctly work with git.
#+BEGIN_SRC emacs-lisp
  (use-package with-editor
    :after magit
    :config
    (define-key (current-global-map)
                [remap async-shell-command] 'with-editor-async-shell-command)
    (define-key (current-global-map)
                [remap shell-command] 'with-editor-shell-command)
    (add-hook 'vterm-mode-hook 'with-editor-export-editor))
#+END_SRC

* Diffs
~ztree~ allows diffing entire directories, instead of buffers or files. Handy when you have multiple projects
based on same template and are looking for drifts or differences.
#+BEGIN_SRC emacs-lisp
  (use-package ztree
    :config
    (defun diff-directories ()
      "Thin wrapper over ztree-diff to be more discoverable"
      (interactive)
      (call-interactively 'ztree-diff)))

#+END_SRC
* Buffer and window management
** Ace window
~ace-window~ allows quickly switching between open windows (splits).
#+BEGIN_SRC emacs-lisp
  (use-package ace-window
    :commands (ace-window)
    :custom
    (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    (aw-background nil))
#+END_SRC
